#проверить истинность высказывания: "среди трех днных целых чисел есть хотябы одна пара взаимно противоположных"
# пример 5 и -5 или 45 и -45
# объяснение: сравниваем каждое число с отрицательным значением другого, если а=-b значит а и b противоположны

a = int(input("Введите число A: "))
b = int(input("Введите число B: "))
c = int(input("Введите число C: "))

# Проверяем все возможные пары
if (a == -b) or (a == -c) or (b == -c):
    print("Истина: есть пара взаимно противоположных чисел")
else:
    print("Ложь: нет взаимно противоположных чисел")

